src/modules/apis/onvif/wsdl/device/probematches.wsdl

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
    <soap:Header>
        <wsa:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
        <wsa:MessageID>urn:uuid:__MESSAGE_ID__</wsa:MessageID>
        <wsa:RelatesTo>__RELATES_TO__</wsa:RelatesTo>
        <d:AppSequence InstanceId="__INSTANCE_ID__" MessageNumber="__MESSAGE_NUMBER__"></d:AppSequence>
    </soap:Header>
    <soap:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:__ADDRESS__</wsa:Address>
                </wsa:EndpointReference>
                <d:Types>
                    tds:Device dn:NetworkVideoTransmitter
                </d:Types>
                <d:XAddrs>
                    __DEVICE_XADDRS__
                </d:XAddrs>
                <d:Scopes>onvif://www.onvif.org/type/NetworkVideoTransmitter</d:Scopes>
                <d:MetadataVersion>1</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </soap:Body>
</soap:Envelope>